Revit 2027 API
ExporterIFCUtils.GetGlobal2DOriginHandle Method
 Obtains the handle representing the 2D origin.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCAnyHandle GetGlobal2DOriginHandle()
Public Shared Function GetGlobal2DOriginHandle As IFCAnyHandle
public:
static IFCAnyHandle^ GetGlobal2DOriginHandle()
static member GetGlobal2DOriginHandle : unit -> IFCAnyHandle
Return Value
IFCAnyHandle
 The handle.
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace